app/controllers/surveys_controller.rb

	def create
		@survey = SurveyData.create(params[:survey_data])
---
INSERT INTO "survey_data" ("gender", "created_at", "age", "updated_at", "celebrity", "soap", "comment", "reaction") VALUES ('Male', '2012-05-22 19:10:56.559062', '17 or Younger', '2012-05-22 19:10:56.559062', 'sczdc', 'qwedc', 'dczc', 'asdas') RETURNING "id"